src/Catalogs/ГруппыПользователейЦентрМониторинга/ГруппыПользователейЦентрМониторинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыПользователейЦентрМониторинга</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>РуководительГруппы</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УчастникиГруппы</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/ДоступныеГруппыЦентрМониторинг/ДоступныеГруппыЦентрМониторинг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДоступныеГруппыЦентрМониторинг</name>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппаПользователей</name>
    <type>
      <types>CatalogRef.ГруппыПользователейЦентрМониторинга</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ГруппыПользователейЦентрМониторинга/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ПередЗаписью(Отказ)
	
	ДобавитьРуководителяВГруппу();
	ЗаполнитьПраваНаГруппу();
		
КонецПроцедуры

Процедура ДобавитьРуководителяВГруппу()
	
	ВГруппе = УчастникиГруппы.Найти(РуководительГруппы, "Пользователь");
	
	Если ВГруппе = Неопределено Тогда 
		СтрокаТЧ = УчастникиГруппы.Добавить();
		СтрокаТЧ.Пользователь = РуководительГруппы;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПраваНаГруппу()
	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписей = РегистрыСведений.ДоступныеГруппыЦентрМониторинг.СоздатьНаборЗаписей();
	Если ЭтоНовый() Тогда 
		ЭтотОбъект.УстановитьСсылкуНового(Справочники.ГруппыПользователейЦентрМониторинга.ПолучитьСсылку());	
		НаборЗаписей.Отбор.ГруппаПользователей.Установить(ЭтотОбъект.ПолучитьСсылкуНового());	
	Иначе
		НаборЗаписей.Отбор.ГруппаПользователей.Установить(Ссылка);
	КонецЕсли;
	
	ТЗ = СформироватьТаблицуЗначенийПользователейПоГруппе();
	
	НаборЗаписей.Загрузить(ТЗ);
	НаборЗаписей.Записать(Истина);
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Функция СформироватьТаблицуЗначенийПользователейПоГруппе()
	
	ТЗ = УчастникиГруппы.Выгрузить();
	ТЗ.Колонки.Добавить("ГруппаПользователей", Новый ОписаниеТипов("СправочникСсылка.ГруппыПользователейЦентрМониторинга"));
	Если ЭтоНовый() Тогда  
		ТЗ.ЗаполнитьЗначения(ЭтотОбъект.ПолучитьСсылкуНового(), "ГруппаПользователей");	
	Иначе
		ТЗ.ЗаполнитьЗначения(Ссылка, "ГруппаПользователей");
	КонецЕсли;
	Возврат ТЗ;
	
КонецФункции

#КонецЕсли
